._design_docs/.test_reports/mtp-jinja-run-20260607-V1/S12-MTP-B06-V1-Jmarked/hybrid/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260607-V1\S12-MTP-B06-V1-Jmarked\hybrid\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 23 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m01.0s/5m0s  00/23 shared iters
warmup      [   0% ] 1 VUs  0m01.0s/2m0s  0/1 shared iters

running (0m02.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m02.0s/5m0s  00/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m03.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m03.0s/5m0s  00/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 2 complete and 0 interrupted iterations
hit_probe   [   4% ] 1 VUs  0m04.0s/5m0s  01/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m05.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  13% ] 1 VUs  0m05.0s/5m0s  03/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m06.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  13% ] 1 VUs  0m06.0s/5m0s  03/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m07.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  17% ] 1 VUs  0m07.0s/5m0s  04/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m08.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  17% ] 1 VUs  0m08.0s/5m0s  04/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m09.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  22% ] 1 VUs  0m09.0s/5m0s  05/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m10.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  22% ] 1 VUs  0m10.0s/5m0s  05/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m11.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
hit_probe   [  30% ] 1 VUs  0m11.0s/5m0s  07/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m12.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
hit_probe   [  35% ] 1 VUs  0m12.0s/5m0s  08/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m13.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
hit_probe   [  35% ] 1 VUs  0m13.0s/5m0s  08/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m14.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  39% ] 1 VUs  0m14.0s/5m0s  09/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m15.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  39% ] 1 VUs  0m15.0s/5m0s  09/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m16.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
hit_probe   [  43% ] 1 VUs  0m16.0s/5m0s  10/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m17.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
hit_probe   [  43% ] 1 VUs  0m17.0s/5m0s  10/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m18.0s), 1/2 VUs, 12 complete and 0 interrupted iterations
hit_probe   [  48% ] 1 VUs  0m18.0s/5m0s  11/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m19.0s), 1/2 VUs, 14 complete and 0 interrupted iterations
hit_probe   [  57% ] 1 VUs  0m19.0s/5m0s  13/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m20.0s), 1/2 VUs, 14 complete and 0 interrupted iterations
hit_probe   [  57% ] 1 VUs  0m20.0s/5m0s  13/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m21.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
hit_probe   [  61% ] 1 VUs  0m21.0s/5m0s  14/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m22.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
hit_probe   [  61% ] 1 VUs  0m22.0s/5m0s  14/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m23.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
hit_probe   [  65% ] 1 VUs  0m23.0s/5m0s  15/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m24.0s), 1/2 VUs, 17 complete and 0 interrupted iterations
hit_probe   [  70% ] 1 VUs  0m24.0s/5m0s  16/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m25.0s), 1/2 VUs, 18 complete and 0 interrupted iterations
hit_probe   [  74% ] 1 VUs  0m25.0s/5m0s  17/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m26.0s), 1/2 VUs, 19 complete and 0 interrupted iterations
hit_probe   [  78% ] 1 VUs  0m26.0s/5m0s  18/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m27.0s), 1/2 VUs, 20 complete and 0 interrupted iterations
hit_probe   [  83% ] 1 VUs  0m27.0s/5m0s  19/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m28.1s), 1/2 VUs, 20 complete and 0 interrupted iterations
hit_probe   [  83% ] 1 VUs  0m28.1s/5m0s  19/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m29.0s), 1/2 VUs, 21 complete and 0 interrupted iterations
hit_probe   [  87% ] 1 VUs  0m29.0s/5m0s  20/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m30.0s), 1/2 VUs, 21 complete and 0 interrupted iterations
hit_probe   [  87% ] 1 VUs  0m30.0s/5m0s  20/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m31.0s), 1/2 VUs, 22 complete and 0 interrupted iterations
hit_probe   [  91% ] 1 VUs  0m31.0s/5m0s  21/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters

running (0m32.0s), 1/2 VUs, 23 complete and 0 interrupted iterations
hit_probe   [  96% ] 1 VUs  0m32.0s/5m0s  22/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    prefix_match_rate
    ✓ 'rate>=0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 24      0.743007/s
    checks_succeeded...: 100.00% 24 out of 24
    checks_failed......: 0.00%   0 out of 24

    ✓ warmup 200
    ✓ probe 200

    CUSTOM
    cache_hit_rate.................: 0.00%   0 out of 23
    cache_miss_prompt_ms...........: avg=497.9ms min=268.08ms med=527.25ms p(95)=829.27ms max=843.1ms
    cache_n_tokens.................: avg=0       min=0        med=0        p(95)=0        max=0      
    prefix_match_rate..............: 100.00% 23 out of 23
    requests_ok....................: 24      0.743007/s

    HTTP
    http_req_duration..............: avg=1.31s   min=690.65ms med=1.27s    p(95)=1.96s    max=3.13s  
      { expected_response:true }...: avg=1.31s   min=690.65ms med=1.27s    p(95)=1.96s    max=3.13s  
    http_req_failed................: 0.00%   0 out of 24
    http_reqs......................: 24      0.743007/s

    EXECUTION
    iteration_duration.............: avg=1.42s   min=791.53ms med=1.37s    p(95)=2.06s    max=3.23s  
    iterations.....................: 24      0.743007/s
    vus............................: 1       min=1        max=2
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 43 kB   1.3 kB/s
    data_sent......................: 6.1 kB  190 B/s



running (0m32.3s), 0/2 VUs, 24 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m32.3s/5m0s  23/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.8s/2m0s  1/1 shared iters